week5/moma-app/app/views/artists/show.html.erb

SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 15]]
---
<ul>
<% @artist.works.each do |work| %>