week5/planets-db/app/controllers/planets_controller.rb

INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "temperature", "moons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    Planet.create(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      temperature: params[:temperature],
      moons: params[:moons]
    )

SELECT "planets".* FROM "planets"
---
  def index
    # Get all rows in the planets table
    # (as an array of Planet objects)
    @planets = Planet.all

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def show
    # Gets us one row, and returns it as an object
    # (an instance of the Planet model class)
    @planet = Planet.find params[:id]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @planet = Planet.find params[:id]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "planets" SET "name" = ?, "orbit" = ?, "diameter" = ?, "mass" = ?, "temperature" = ?, "moons" = ?, "updated_at" = ? WHERE "planets"."id" = ?  [["name", "Saturn 2"], ["orbit", 602.0], ["diameter", 100.2], ["mass", 4000.2], ["temperature", 0.012], ["moons", 16], ["updated_at", "2018-10-09 04:27:33.616155"], ["id", 21]]
---
  def update
    planet = Planet.find params[:id]
    planet.update(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      temperature: params[:temperature],
      moons: params[:moons]
    )

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 19]]
---
  def destroy
    planet = Planet.find params[:id]
    planet.destroy