week8/secrets-app/secrets-server/app/controllers/secrets_controller.rb

  def index
    render json: Secret.all.reverse
---
SELECT "secrets".* FROM "secrets"

  def create
    secret = Secret.create content: params[:content]
---
INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "dunno"], ["created_at", "2018-10-30 01:58:38.366864"], ["updated_at", "2018-10-30 01:58:38.366864"]]