week5/tunr-db-wdi29/app/controllers/application_controller.rb

  def fetch_user
    # Check if session[:user_id] is set, and also if it stores
    # a valid user ID, and if so, set an instance variable
    # containing the user object

    if session[:user_id].present?
      @current_user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]