week5/tunr-db-wdi29/app/controllers/mixtapes_controller.rb

INSERT INTO "mixtapes" ("name", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "proper name"], ["image", "http://placekitten.com/400/400"], ["created_at", "2018-10-12 03:35:28.616102"], ["updated_at", "2018-10-12 03:35:28.616102"], ["user_id", 15]]
---
  def create
    # Multi-step way to create a new Mixtape record in the database
    # for when we have to add some data that is not in the submitted
    # form (i.e., the user ID from the currently logged-in user):
    # First make a .new object, set the extra field, then .save

    @mixtape = Mixtape.new( mixtape_params )  # strong params
    @mixtape.user = @current_user
    # could also write: mixtape.user_id = @current_user.id
    @mixtape.save

SELECT "mixtapes".* FROM "mixtapes"
---
  def index
    @mixtapes = Mixtape.all

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def show
    @mixtape = Mixtape.find params[:id]  # key comes from /mixtapes/:id

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @mixtape = Mixtape.find params[:id]  # key comes from /mixtapes/:id

SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "mixtapes" SET "name" = $1, "image" = $2, "updated_at" = $3 WHERE "mixtapes"."id" = $4  [["name", "this will work"], ["image", "http://placekitten.com/500/500"], ["updated_at", "2018-10-12 03:48:22.476961"], ["id", 20]]
---
  def update
    @mixtape = Mixtape.find params[:id]  # key comes from /mixtapes/:id

    # Check that the owner of this mixtape is STILL the logged-in user
    # (i.e. the ID in the edit form action was not tampered with)
    unless @mixtape.user == @current_user
      redirect_to(mixtapes_path) # this alone does not stop the action
      return  # stop the rest of the action from running! i.e. the update below
    end

    # check whether the update actually changed the DB or not
    # (.update returns true if it did change the DB, false if there was an error)
    if @mixtape.update( mixtape_params )