week5/tunr-db-wdi29/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "luke@ga.co"], ["LIMIT", 1]]
---
  def create
    # see if the email address entered actually corresponds to a user in the table
    user = User.find_by email: params[:email]