week7/ajax-on-rails/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "age", "roundness", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aaa"], ["age", 2], ["roundness", 3], ["image", "d"], ["created_at", "2018-10-25 04:37:14.166428"], ["updated_at", "2018-10-25 04:37:14.166428"]]
---
  def create
    new_dog = Dog.create(
      name: params[:name],
      age: params[:age],
      roundness: params[:roundness],
      image: params[:image]
    )

SELECT "dogs".* FROM "dogs"
---
  def index
    render json: Dog.all