week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "dob", "period", "image", "roundness", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    # use 'strong params' to filter the fields from the form (for security reasons)
    Artist.create( artist_params )

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.all # returns an array of Artist objects

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find params[:id] # returns one Artist object

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "nationality" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Brett Whitely"], ["nationality", "Ockaaaaa"], ["updated_at", "2018-10-10 03:24:41.597589"], ["id", 6]]
---
  def update
    @artist = Artist.find params[:id]
    @artist.update artist_params