week5/moma-app/app/controllers/works_controller.rb

  def create
    Work.create work_params  # pass in the strong version of the form params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @work = Work.find params[:id]  # ID is in params because of the route "/works/:id"
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @work = Work.find params[:id]   # route is PATCH "/works/:id", so we have the ID in params
    @work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "works" SET "title" = ?, "medium" = ?, "style" = ?, "image" = ?, "artist_id" = ?, "updated_at" = ? WHERE "works"."id" = ?

  def destroy
    @work = Work.find params[:id]
    @work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 7]]