week5/tunr-db-wdi29/app/views/mixtapes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
 -->
<% if @current_user.present? && @mixtape.user == @current_user %>