week5/moma-app/app/views/works/_form.html.erb

SELECT "artists".* FROM "artists"
---
    <%= f.label :artist_id, 'Artist' %>
    <%= f.collection_select :artist_id, Artist.all, :id, :name, prompt: 'Please choose the artist' %>